---
title: SpatialElementGeometryCalculator
classe: Autodesk.Revit.DB.SpatialElementGeometryCalculator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# SpatialElementGeometryCalculator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `spatialElementGeometryCalculator.IsValidObject` | Boolean |
| `SpatialElementGeometryResults CalculateSpatialElementGeometry(SpatialElement)` | `spatialElementGeometryCalculator.CalculateSpatialElementGeometry(spatialElement)` | SpatialElementGeometryResults |
| `Boolean CanCalculateGeometry(SpatialElement)` | `SpatialElementGeometryCalculator.CanCalculateGeometry(spatialElement)` | Boolean |
| `Void Dispose()` | `spatialElementGeometryCalculator.Dispose()` | Void |
| `SpatialElementBoundaryOptions GetOptions()` | `spatialElementGeometryCalculator.GetOptions()` | SpatialElementBoundaryOptions |
| `Boolean IsRoomOrSpace(SpatialElement)` | `SpatialElementGeometryCalculator.IsRoomOrSpace(spatialElement)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```